(package! visual-fill-column)

(package! doom-snippets :ignore t)

(package! eglot-ltex
  :recipe (:host github :repo "emacs-languagetool/eglot-ltex"))

(package! org-superstar)

;;(package! org-roam)
(package! org-roam-bibtex)  ;; Use org-roam for paper notes
(package! org-ref)          ;; org-ref handles bibtex in org

(package! org-download)

(package! org-reveal)
